#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/team-blackcat/e-com-blackcat/runs/run-G9vbWYbyVdTMg6RT

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.google_secret_manager_secret.password: Reading...
data.google_secret_manager_secret.host: Reading...
data.google_secret_manager_secret.user: Reading...
data.google_secret_manager_secret.database: Reading...
data.google_secret_manager_secret.database: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-database-blackcat]
data.google_secret_manager_secret.host: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-address]
data.google_secret_manager_secret.password: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-password-blackcat]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/blackcat-backend]
data.google_secret_manager_secret.user: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-user-blackcat]
google_cloud_run_service_iam_member.invokers_backend: Refreshing state... [id=v1/projects/ceri-m1-ecommerce-2022/locations/europe-west1/services/blackcat-backend/roles/run.invoker/allUsers]
google_cloud_run_service.frontend: Refreshing state... [id=locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/blackcat-frontend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.frontend has changed
  ~ resource "google_cloud_run_service" "frontend" {
        id                         = "locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/blackcat-frontend"
        name                       = "blackcat-frontend"
      + status                     = [
          + {
              + conditions                   = [
                  + {
                      + message = <<-EOT
                            Revision 'blackcat-frontend-rc7qs' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=5000 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=ceri-m1-ecommerce-2022&resource=cloud_run_revision/service_name/blackcat-frontend/revision_name/blackcat-frontend-rc7qs&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22blackcat-frontend%22%0Aresource.labels.revision_name%3D%22blackcat-frontend-rc7qs%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      + reason  = "HealthCheckContainerError"
                      + status  = "False"
                      + type    = "Ready"
                    },
                  + {
                      + message = <<-EOT
                            The user-provided container failed to start and listen on the port defined provided by the PORT=5000 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=ceri-m1-ecommerce-2022&resource=cloud_run_revision/service_name/blackcat-frontend/revision_name/blackcat-frontend-rc7qs&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22blackcat-frontend%22%0Aresource.labels.revision_name%3D%22blackcat-frontend-rc7qs%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      + reason  = "HealthCheckContainerError"
                      + status  = "False"
                      + type    = "ConfigurationsReady"
                    },
                  + {
                      + message = <<-EOT
                            Revision 'blackcat-frontend-rc7qs' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=5000 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=ceri-m1-ecommerce-2022&resource=cloud_run_revision/service_name/blackcat-frontend/revision_name/blackcat-frontend-rc7qs&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22blackcat-frontend%22%0Aresource.labels.revision_name%3D%22blackcat-frontend-rc7qs%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      + reason  = "HealthCheckContainerError"
                      + status  = "False"
                      + type    = "RoutesReady"
                    },
                ]
              + latest_created_revision_name = "blackcat-frontend-rc7qs"
              + latest_ready_revision_name   = ""
              + observed_generation          = 1
              + url                          = ""
            },
        ]
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.frontend is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "frontend" {
      ~ id                         = "locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/blackcat-frontend" -> (known after apply)
        name                       = "blackcat-frontend"
      ~ project                    = "ceri-m1-ecommerce-2022" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = <<-EOT
                            Revision 'blackcat-frontend-rc7qs' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=5000 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=ceri-m1-ecommerce-2022&resource=cloud_run_revision/service_name/blackcat-frontend/revision_name/blackcat-frontend-rc7qs&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22blackcat-frontend%22%0Aresource.labels.revision_name%3D%22blackcat-frontend-rc7qs%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = <<-EOT
                            The user-provided container failed to start and listen on the port defined provided by the PORT=5000 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=ceri-m1-ecommerce-2022&resource=cloud_run_revision/service_name/blackcat-frontend/revision_name/blackcat-frontend-rc7qs&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22blackcat-frontend%22%0Aresource.labels.revision_name%3D%22blackcat-frontend-rc7qs%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = <<-EOT
                            Revision 'blackcat-frontend-rc7qs' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=5000 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=ceri-m1-ecommerce-2022&resource=cloud_run_revision/service_name/blackcat-frontend/revision_name/blackcat-frontend-rc7qs&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22blackcat-frontend%22%0Aresource.labels.revision_name%3D%22blackcat-frontend-rc7qs%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "blackcat-frontend-rc7qs"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "b185e236-8789-4b31-b74b-84f59eccf1bd"
              - "serving.knative.dev/creator"       = "terraform-blackcat@ceri-m1-ecommerce-2022.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "terraform-blackcat@ceri-m1-ecommerce-2022.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
            } -> (known after apply)
          ~ namespace        = "ceri-m1-ecommerce-2022" -> (known after apply)
          ~ resource_version = "AAXx0mpBk6Q" -> (known after apply)
          ~ self_link        = "/apis/serving.knative.dev/v1/namespaces/351985998296/services/blackcat-frontend" -> (known after apply)
          ~ uid              = "9cb5b82f-79fe-486a-b5e5-fe45fce4d8d8" -> (known after apply)
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale" = "5"
                } -> (known after apply)
              ~ generation       = 0 -> (known after apply)
              ~ labels           = {} -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                    # (1 unchanged attribute hidden)

                  ~ ports {
                      ~ container_port = 5000 -> 80
                      ~ name           = "http1" -> (known after apply)
                    }

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> (known after apply)
                      ~ requests = {} -> (known after apply)
                    }

                    # (1 unchanged block hidden)
                }
            }
        }

      ~ traffic {
          ~ latest_revision = true -> (known after apply)
          ~ percent         = 100 -> (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + client_url = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "TF_VAR_GOOGLE_APPLICATION_CREDENTIALS" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-G9vbWYbyVdTMg6RT/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pushed by: @iammouadagr, Action: `pull_request`*